"""
打印一张简单的IP地址规划表
假设你负责一个小型网络，有3台设备，请定义变量并打印如下格式的IP规划表:

========== IP地址规划表 ==========
设备名称          管理地址          角色
-----------------------------------------
CoreSwitch        10.1.1.1          核心交换机
Firewall          10.1.1.2          防火墙
WLC               10.1.1.3          无线控制器
=========================================
提示: 可以直接用多个print语句，也可以尝试用 \t (Tab) 来对齐。
"""
print("========== IP地址规划表 ==========")
print("设备名称          管理地址          角色")
print("-----------------------------------------")
print("CoreSwitch        10.1.1.1          核心交换机")
print("Firewall          10.1.1.2          防火墙")
print("WLC               10.1.1.3          无线控制器")
print("========================================")